name = input("Пожалуйста, введите имя: ")
print("Меня зовут ", name)
date = int(input("Укажите количество полных лет: "))
print("Мой возраст ", date)
city = input("Укажите город проживания:  ")
print("Город проживания - ", city)
x = int(input("Введите число: "))
if x > 0:
    print("Введенное число больше 0")
elif x < 0:
    print("Введенное число меньше 0")
elif x == 0:
    print("Число равно 0")
print("Спасибо за участие!")
